
Процедура ПосчитатьПроцент()
	Если НЕ Запись.РезультатНаНачало = Запись.РезультатПоОкончании Тогда
		Рез = Окр((Запись.РезультатПоОкончании - Запись.РезультатНаНачало)/Запись.РезультатНаНачало*100, 2);
		Если Рез > 0 Тогда
			Элементы.Декорация1.Заголовок = "Рост " + Рез + "%";
			Если НЕ Запись.ОбщийРезультат = Элементы.Декорация1.Заголовок Тогда
				Запись.ОбщийРезультат = Элементы.Декорация1.Заголовок;
			КонецЕсли;			
		ИначеЕсли Рез < 0 Тогда
			Элементы.Декорация1.Заголовок = "Падение " + Рез + "%";
			Если НЕ Запись.ОбщийРезультат = Элементы.Декорация1.Заголовок Тогда
				Запись.ОбщийРезультат = Элементы.Декорация1.Заголовок;
			КонецЕсли;
		Иначе
			Элементы.Декорация1.Заголовок = "0";
			Если НЕ Запись.ОбщийРезультат = Элементы.Декорация1.Заголовок Тогда
				Запись.ОбщийРезультат = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ПосчитатьПроцент();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РезультатНаНачалоПриИзмененииНаСервере()
	ПосчитатьПроцент();
КонецПроцедуры

&НаКлиенте
Процедура РезультатНаНачалоПриИзменении(Элемент)
	РезультатНаНачалоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РезультатПоОкончанииПриИзмененииНаСервере()
	ПосчитатьПроцент();
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоОкончанииПриИзменении(Элемент)
	РезультатПоОкончанииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоНовый = Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи) ; 
    Копирование = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	Если Копирование И НЕ Параметры.ЗначениеКопирования.Период = '00010101' Тогда
		Запись.Период = НачалоДня(Параметры.ЗначениеКопирования.Период + 86400);
		Запись.Карта = Неопределено;
		Запись.Перевернутая = Ложь;  
		МЗ = РегистрыСведений.КартаДня.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Параметры.ЗначениеКопирования);
		МЗ.Прочитать();
		Запись.РезультатНаНачало = МЗ.РезультатПоОкончании;
		Запись.РезультатПоОкончании = 0;
		Запись.ЗначениеКарты = "";
		Запись.ОбщийРезультат = "";
	КонецЕсли;
	
КонецПроцедуры
