
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	
	
	//	Представлениеп = найдФото[0].ПолноеИмя;
	//	ДвоичныеДанныеФотографии = Новый ДвоичныеДанные(Представлениеп);

	//	Base64ДанныеФотографии = Base64Строка(ДвоичныеДанныеФотографии);

	//    ПредставлениеХТМЛ = "<html>
	//						|  <head>
	//						|    <meta http-equiv=""X-UA-Compatible"" content=""IE=9"" /> 
	//						|   	<style type=""text/css"">
	//						|       body { 
	//						|			height: 300px;
	//						|			width: 300px;
	//						|			object-fit: cover;							
	//						|       }
	//						|
	//						|   </style>
	//						|  </head>
	//						|  <body>
	//						|	<img src='data:image/;base64," + Base64ДанныеФотографии + "'>
	//						|  </body>
	//						|</html>";
	//КонецЕсли;
КонецПроцедуры

 &НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Не Результат Тогда
		Возврат; 
	КонецЕсли;
	
	ПредставлениеХТМЛ = Адрес;
КонецПроцедуры

 &НаКлиенте
 Процедура ОбработатьПоискФайла(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	 Если НайденныеФайлы.Количество() = 0 Тогда
		ПредставлениеХТМЛ = "";
	Иначе
		Оповещение  =  Новый ОписаниеОповещения("ОбработатьВыборФайла",   ЭтотОбъект);
		НачатьПомещениеФайла(Оповещение, , НайденныеФайлы[0].ПолноеИмя , Ложь, УникальныйИдентификатор);
	КонецЕсли;
	
 КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Наименование = "" Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокаСоединенияСБД = СтрРазделить(СтрокаСоединенияИнформационнойБазы(), Символ(34));
	Оповещение  =  Новый ОписаниеОповещения("ОбработатьПоискФайла",   ЭтотОбъект);
	НачатьПоискФайлов(Оповещение, СтрокаСоединенияСБД[1]+"\ФОТО\", "" + Объект.Наименование + ".*");
		
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если Объект.Наименование = "" Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокаСоединенияСБД = СтрРазделить(СтрокаСоединенияИнформационнойБазы(), Символ(34));
	Оповещение  =  Новый ОписаниеОповещения("ОбработатьПоискФайла",   ЭтотОбъект);
	НачатьПоискФайлов(Оповещение, СтрокаСоединенияСБД[1]+"\ФОТО\", "" + Объект.Наименование + ".*");

КонецПроцедуры

